# Imorting pandas

In [ ]:
## what is Data Manipulation ##

In [ ]:
# Data manipulation refers to the process of changing, transforming, or otherwise modifying 
# data in order to make it more useful or easier to work with

In [1]:
import pandas as pd
import numpy as np

# Pandas Series

# Creating pandas series

In [10]:
a=pd.Series([1,3,6,4,6,"cat"])
print(a)

0      1
1      3
2      6
3      4
4      6
5    cat
dtype: object

In [11]:
type(a)

pandas.core.series.Series

In [12]:
a[0]

1

In [13]:
a[3]

4

In [14]:
b=pd.Series([12,23,4.34,"Cat"],index=["a","b","c","d"])
print(b)

a      12
b      23
c    4.34
d     Cat
dtype: object

In [15]:
b[0]

12

In [16]:
b["a"]

12

In [17]:
c=pd.Series({"a":10,"b":20,"g":30,"x":40})
c

a    10
b    20
g    30
x    40
dtype: int64

# Accessing values inside pandas series

In [18]:
my_series=pd.Series([1,2,3,4,"Cat"],index=["a","b","c","d","e"])
my_series

a      1
b      2
c      3
d      4
e    Cat
dtype: object

In [19]:
my_series[0]

1

In [20]:
my_series[3]

4

In [21]:
my_series["a"]

1

In [22]:
my_series["e"]

'Cat'

# Pandas Data Frames

# Creating pandas data frames

# (01) Using dictionaries

In [23]:
details={"Name":["Jane","David","Kane","Sammie","Jack"],"Age":[32,27,43,45,24],"Gender":["F","M","M","F","M"]}
details

{'Name': ['Jane', 'David', 'Kane', 'Sammie', 'Jack'],
 'Age': [32, 27, 43, 45, 24],
 'Gender': ['F', 'M', 'M', 'F', 'M']}

In [24]:
df=pd.DataFrame(details)   # the most popular technique to dictionary. if we create a data set manualy

In [25]:
df

     Name  Age Gender
0    Jane   32      F
1   David   27      M
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

In [26]:
print(df)

     Name  Age Gender
0    Jane   32      F
1   David   27      M
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

In [27]:
type(df)

pandas.core.frame.DataFrame

# (02) Using numpy arrays

In [28]:
arr=np.array([[12,24],[23,15],[34,37]])
arr

array([[12, 24],
       [23, 15],
       [34, 37]])

In [31]:
df1=pd.DataFrame(arr,columns=["col1","col2"])
df1

   col1  col2
0    12    24
1    23    15
2    34    37

# (03) Using pandas series

In [32]:
my_series=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
my_series

a    1
b    2
c    3
d    4
e    7
dtype: int64

In [35]:
df2=my_series.to_frame() #one column dta frame
df2.columns=["Col 1"]   
df2

   Col 1
a      1
b      2
c      3
d      4
e      7

In [36]:
type(df2)

pandas.core.frame.DataFrame

In [37]:
#Two different series

my_series1=pd.Series([1,2,3,4,7],index=["a","b","c","d","e"])
my_series2=pd.Series([6,5,7,8,2],index=["a","b","c","d","e"])

In [41]:
df3=pd.concat([my_series1,my_series2],axis=1)
df3.columns=["col 1","col 2"]
df3

   col 1  col 2
a      1      6
b      2      5
c      3      7
d      4      8
e      7      2

In [42]:
type(df3)

pandas.core.frame.DataFrame

# (04) Creating data frames using CSV files

In [3]:
df3=pd.read_csv("C:\\Users\\ASUS\\Desktop\\DS Course\Day 11\\iris.csv")
df3

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [4]:
type(df3)

pandas.core.frame.DataFrame

# Top values of the data set

In [5]:
df3.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [6]:
df3.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [7]:
df3.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

# Bottom values of the data set

In [8]:
df3.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [9]:
df3.tail(2)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [10]:
details=pd.DataFrame({"Name":["Jane","David","Kane","Sammie","Jack"],"Age":[32,27,43,45,24],"Gender":["F","M","M","F","M"]})
details

     Name  Age Gender
0    Jane   32      F
1   David   27      M
2    Kane   43      M
3  Sammie   45      F
4    Jack   24      M

In [14]:
details.head(2)

    Name  Age Gender
0   Jane   32      F
1  David   27      M

In [13]:
details.tail(2)

     Name  Age Gender
3  Sammie   45      F
4    Jack   24      M

# Description

In [16]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

# Columns & indexes of the data set

In [19]:
df3.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [20]:
list(df3.columns)

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [22]:
print(list(df3.index))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]

In [23]:
df3.index

RangeIndex(start=0, stop=150, step=1)

# Shape of the data frame

In [24]:
df3.shape

(150, 5)

# Data type of columns

In [26]:
df3['Sepal.Length'].dtype

dtype('float64')

# Separating data types in data frames

In [28]:
df4=df3.select_dtypes(include=float)
df4     #show only float type data

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [33]:
df5=df3.select_dtypes(include=object)
df5     #show only String type data

       Species
0       setosa
1       setosa
2       setosa
3       setosa
4       setosa
..         ...
145  virginica
146  virginica
147  virginica
148  virginica
149  virginica

[150 rows x 1 columns]

# (05) Creating data frames using Excel files

In [38]:
df6=pd.read_excel("C:\\Users\\ASUS\\Desktop\\DS Course\\Day 11\\Excel Data.xlsx",sheet_name="marks")\
# use the sheet_name for access the other sheet 
# we can't use this option in read_csv

In [39]:
df6

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [41]:
#### another method ####

In [42]:
ef=pd.ExcelFile("C:\\Users\\ASUS\\Desktop\\DS Course\\Day 11\\Excel Data.xlsx")
ef             ##this only access the file

In [44]:
## to access the data frame

ef.sheet_names  # gives the sheet names

['iris', 'marks']

In [45]:
df7=ef.parse("marks")   #access the marks sheet data
df7.head()

   ID  Marks
0   1     67
1   2     78
2   3     76
3   4     66
4   5     89

In [46]:
df8=ef.parse("iris")   #access the iris sheet data
df8.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# Adding new columns

In [48]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [58]:
df["Col 4"]=[100,102,103,105,106]

In [59]:
df

   Col1  Col2  Col3  Col 4
0    12    45    56    100
1    22    43    43    102
2    23    44    46    103
3    34    46    67    105
4    45    54    65    106

# Accessing columns & elements

In [47]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

# Accessing columns

In [52]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col 4'], dtype='object')

In [53]:
df["Col1"]

0    12
1    22
2    23
3    34
4    45
Name: Col1, dtype: int64

In [54]:
type(df["Col1"])

pandas.core.series.Series

In [55]:
df[["Col1","Col2"]]

   Col1  Col2
0    12    45
1    22    43
2    23    44
3    34    46
4    45    54

In [56]:
type(df[["Col1","Col2"]])

pandas.core.frame.DataFrame

In [62]:
df["Col1"][1]=20
df

   Col1  Col2  Col3  Col 4
0    12    45    56    100
1    20    43    43    102
2    23    44    46    103
3    34    46    67    105
4    45    54    65    106

# Accessing elements

In [63]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [68]:
df["Col1"][2]

23

In [69]:
df.iloc[2,1]

44

In [70]:
df.iat[2,1]

44

In [71]:
df.loc[0,"Col1"]

12

In [72]:
df.at[0,"Col1"]

12

In [73]:
df.iloc[1:4,1:]

   Col2  Col3
1    43    43
2    44    46
3    46    67

In [74]:
df.iloc[2,1]=100
df                          #data frames are mutable , so we can chage values

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23   100    46
3    34    46    67
4    45    54    65

# Converting to arrays

In [75]:
df=pd.DataFrame({"Col1":[12,22,23,34,45],"Col2":[45,43,44,46,54],"Col3":[56,43,46,67,65]})
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

In [76]:
np.array(list(df["Col1"]))

array([12, 22, 23, 34, 45])

In [77]:
df["Col1"].values

array([12, 22, 23, 34, 45], dtype=int64)

In [78]:
df.values

array([[12, 45, 56],
       [22, 43, 43],
       [23, 44, 46],
       [34, 46, 67],
       [45, 54, 65]], dtype=int64)

In [79]:
df

   Col1  Col2  Col3
0    12    45    56
1    22    43    43
2    23    44    46
3    34    46    67
4    45    54    65

# Basic column operations

In [80]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [82]:
df["Col3"]=(df["Col1"]+df["Col2"])/2

In [83]:
df

   Col1  Col2  Col3
0     0     1   0.5
1     2     3   2.5
2     4     5   4.5
3     6     7   6.5
4     8     9   8.5

In [84]:
df["Col4"]=["High" if v>=5 else "Low" for v in df["Col3"]]
df

   Col1  Col2  Col3  Col4
0     0     1   0.5   Low
1     2     3   2.5   Low
2     4     5   4.5   Low
3     6     7   6.5  High
4     8     9   8.5  High

# Pandas data frames with apply function

In [5]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [88]:
df.apply(sum,axis=0)

Col1    20
Col2    25
dtype: int64

##

In [89]:
df.apply(sum,axis=1)

0     1
1     5
2     9
3    13
4    17
dtype: int64

In [92]:
df.apply(len,axis=0)

Col1    5
Col2    5
dtype: int64

In [6]:
df.apply(max,axis=0)

Col1    8
Col2    9
dtype: int64

In [7]:
df.apply(np.median,axis=0)

Col1    4.0
Col2    5.0
dtype: float64

In [8]:
df.apply(lambda a : np.mean(a)/np.std(a),axis=0)

Col1    1.414214
Col2    1.767767
dtype: float64

In [9]:
df=pd.DataFrame({"English":[45,54,57,46,58],"Maths":[42,54,57,41,76]})
df

   English  Maths
0       45     42
1       54     54
2       57     57
3       46     41
4       58     76

In [22]:
#create a column that includes averages

df["avg"]=df.apply(np.mean,axis=1)

In [23]:
df

   English  Maths   avg
0       45     42  43.5
1       54     54  54.0
2       57     57  57.0
3       46     41  43.5
4       58     76  67.0

In [25]:
#creates a column to show pass fail

df["Status"]=df.apply(lambda L : "Pass" if np.mean(L)>=50 else "Fail",axis=1)

In [26]:
df

   English  Maths   avg Status
0       45     42  43.5   Fail
1       54     54  54.0   Pass
2       57     57  57.0   Pass
3       46     41  43.5   Fail
4       58     76  67.0   Pass

# Pandas data frames with map function

In [31]:
data = np.arange(10).reshape(5,2)
df = pd.DataFrame(data,columns=["Col1","Col2"])
df

   Col1  Col2
0     0     1
1     2     3
2     4     5
3     6     7
4     8     9

In [30]:
#method 1
df["Col3"]=df["Col2"]*3
df

   Col1  Col2  Col3
0     0     1     3
1     2     3     9
2     4     5    15
3     6     7    21
4     8     9    27

In [32]:
#method 2
df["Col3"]=df["Col2"].map(lambda x : 3*x)
df

   Col1  Col2  Col3
0     0     1     3
1     2     3     9
2     4     5    15
3     6     7    21
4     8     9    27

In [34]:
df=pd.DataFrame({"English":[45,54,57,46,56],"Maths" : [42,54,57,41,76]})
df

   English  Maths
0       45     42
1       54     54
2       57     57
3       46     41
4       56     76

In [36]:
df["Avarage"]=(df["English"]+df["Maths"])/2
df

   English  Maths  Avarage
0       45     42     43.5
1       54     54     54.0
2       57     57     57.0
3       46     41     43.5
4       56     76     66.0

In [38]:
df["Result"]=df["Avarage"].map(lambda L : "Pass" if L>=50 else "Fail")
df

   English  Maths  Avarage Result
0       45     42     43.5   Fail
1       54     54     54.0   Pass
2       57     57     57.0   Pass
3       46     41     43.5   Fail
4       56     76     66.0   Pass

# Selecting rows that have certain values

# Boolean masking technique

In [39]:
df=pd.DataFrame({"Name":["A","B","C","D","E","F"],"Age":[23,33,21,35,23,34],"Result":["Pass","Fail","Pass","Pass","Fail","Fail"]})
df

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
4    E   23   Fail
5    F   34   Fail

In [43]:
# output the Passed ones

df[df["Result"]=="Pass"]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [44]:

df[df["Age"]>=30]

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [47]:
#pass ones who's age>=30

df[(df["Result"]=="Pass") & (df["Age"]>=30)]

  Name  Age Result
3    D   35   Pass

In [48]:
#pass ones and  age>=30

df[(df["Result"]=="Pass") | (df["Age"]>=30)]

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
5    F   34   Fail

In [56]:
# not Age>=30

df[~(df["Age"]>=30)]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
4    E   23   Fail

# Selecting with map function

In [57]:
df[df["Result"].map(lambda L : "Pass" in L)]

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

# Pandas queries

In [67]:
df.query('Result == "Pass"')

  Name  Age Result
0    A   23   Pass
2    C   21   Pass
3    D   35   Pass

In [68]:
df.query('Age>=30')

  Name  Age Result
1    B   33   Fail
3    D   35   Pass
5    F   34   Fail

In [69]:
df.query('Age>=30 and Result=="Pass"')

  Name  Age Result
3    D   35   Pass

In [70]:
df.query('Age>=30 or Result=="Pass"')

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass
3    D   35   Pass
5    F   34   Fail

In [71]:
df.query('not Result=="Pass"')

  Name  Age Result
1    B   33   Fail
4    E   23   Fail
5    F   34   Fail

# Data summaries

In [72]:
data=np.random.random(10).reshape(5,2)
data

array([[0.62673546, 0.52669861],
       [0.88141425, 0.1584179 ],
       [0.44018221, 0.3196364 ],
       [0.45704071, 0.64128869],
       [0.12344801, 0.56769911]])

In [73]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

          A         B
a  0.626735  0.526699
b  0.881414  0.158418
c  0.440182  0.319636
d  0.457041  0.641289
e  0.123448  0.567699

# Summaries for each column

In [75]:
df.describe()               # this describe function only works for columns

              A         B
count  5.000000  5.000000
mean   0.505764  0.442748
std    0.277753  0.198796
min    0.123448  0.158418
25%    0.440182  0.319636
50%    0.457041  0.526699
75%    0.626735  0.567699
max    0.881414  0.641289

# Summaries for each row

In [76]:
#since describe() works only for columns , we use transpose() to interchange rows and columns , and then we use describe()
df

          A         B
a  0.626735  0.526699
b  0.881414  0.158418
c  0.440182  0.319636
d  0.457041  0.641289
e  0.123448  0.567699

In [77]:
df.transpose()                   # interchanging the rows and columns

          a         b         c         d         e
A  0.626735  0.881414  0.440182  0.457041  0.123448
B  0.526699  0.158418  0.319636  0.641289  0.567699

In [78]:
df.transpose().describe()

              a         b         c         d         e
count  2.000000  2.000000  2.000000  2.000000  2.000000
mean   0.576717  0.519916  0.379909  0.549165  0.345574
std    0.070737  0.511236  0.085239  0.130283  0.314133
min    0.526699  0.158418  0.319636  0.457041  0.123448
25%    0.551708  0.339167  0.349773  0.503103  0.234511
50%    0.576717  0.519916  0.379909  0.549165  0.345574
75%    0.601726  0.700665  0.410046  0.595227  0.456636
max    0.626735  0.881414  0.440182  0.641289  0.567699

# Categorical columns

In [79]:
df=pd.DataFrame({"A":[23,34,21,45,67],"B":[45,24,67,88,67],"C":["a","a","b","b","a"]})
df

    A   B  C
0  23  45  a
1  34  24  a
2  21  67  b
3  45  88  b
4  67  67  a

In [80]:
df.describe()

               A          B
count   5.000000   5.000000
mean   38.000000  58.200000
std    18.841444  24.427444
min    21.000000  24.000000
25%    23.000000  45.000000
50%    34.000000  67.000000
75%    45.000000  67.000000
max    67.000000  88.000000

In [81]:
df.describe(include="all")

                A          B    C
count    5.000000   5.000000    5
unique        NaN        NaN    2
top           NaN        NaN    a
freq          NaN        NaN    3
mean    38.000000  58.200000  NaN
std     18.841444  24.427444  NaN
min     21.000000  24.000000  NaN
25%     23.000000  45.000000  NaN
50%     34.000000  67.000000  NaN
75%     45.000000  67.000000  NaN
max     67.000000  88.000000  NaN

# Finding sums for columns and rows separately

In [82]:
data=np.random.random(10).reshape(5,2)
data

array([[0.17290813, 0.97672541],
       [0.87370618, 0.56434306],
       [0.94505103, 0.16536234],
       [0.37283833, 0.24081131],
       [0.60497066, 0.57745531]])

In [83]:
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

          A         B
a  0.172908  0.976725
b  0.873706  0.564343
c  0.945051  0.165362
d  0.372838  0.240811
e  0.604971  0.577455

In [84]:
# column wise summazion
df.sum()

A    2.969474
B    2.524697
dtype: float64

In [85]:
# row wise summazion
df.sum(axis=1)

a    1.149634
b    1.438049
c    1.110413
d    0.613650
e    1.182426
dtype: float64

# Cumulative summaries

In [96]:
df

          A         B
a  0.172908  0.976725
b  0.873706  0.564343
c  0.945051  0.165362
d  0.372838  0.240811
e  0.604971  0.577455

In [93]:
 df.cumsum()

          A         B
a  0.172908  0.976725
b  1.046614  1.541068
c  1.991665  1.706431
d  2.364504  1.947242
e  2.969474  2.524697

In [95]:
df.cumsum(axis=1)

          A         B
a  0.172908  1.149634
b  0.873706  1.438049
c  0.945051  1.110413
d  0.372838  0.613650
e  0.604971  1.182426

In [97]:
df.cummin()

          A         B
a  0.172908  0.976725
b  0.172908  0.564343
c  0.172908  0.165362
d  0.172908  0.165362
e  0.172908  0.165362

In [98]:
df.cummax()

          A         B
a  0.172908  0.976725
b  0.873706  0.976725
c  0.945051  0.976725
d  0.945051  0.976725
e  0.945051  0.976725

In [99]:
df.cumprod()

          A         B
a  0.172908  0.976725
b  0.151071  0.551208
c  0.142770  0.091149
d  0.053230  0.021950
e  0.032203  0.012675

# Finding means for columns and rows separately

In [86]:
df.mean()

A    0.593895
B    0.504939
dtype: float64

In [87]:
df.mean(axis=1)

a    0.574817
b    0.719025
c    0.555207
d    0.306825
e    0.591213
dtype: float64

In [88]:
df.max()

A    0.945051
B    0.976725
dtype: float64

In [89]:
df.max(axis=1)

a    0.976725
b    0.873706
c    0.945051
d    0.372838
e    0.604971
dtype: float64

In [90]:
df.median()

A    0.604971
B    0.564343
dtype: float64

In [101]:
df.median(axis=1)

a    0.574817
b    0.719025
c    0.555207
d    0.306825
e    0.591213
dtype: float64

# Finding minumum and maximum for columns and rows separately

# Dropping rows & columns

In [102]:
df=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

# Dropping rows

In [104]:
df.drop("a")             #removing row a     , but the original dataframe is not afected

  Name  Age Result
b    B   33   Fail
c    C   21   Pass

In [105]:
df

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [109]:
df.drop(["a","c"])

  Name  Age Result
b    B   33   Fail

In [117]:
df1=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]})   #no lables
df

  Name  Age Result
1    B   33   Fail
2    C   21   Pass

In [119]:
df1.drop(0)

  Name  Age Result
1    B   33   Fail
2    C   21   Pass

In [120]:
df1            #original data frame is not affected

  Name  Age Result
0    A   23   Pass
1    B   33   Fail
2    C   21   Pass

In [121]:
df1.drop(0,inplace=True)            #using inplace we can do the changes to the original table
df1

  Name  Age Result
1    B   33   Fail
2    C   21   Pass

# Dropping columns

In [146]:
df1=pd.DataFrame({"Name":["A","B","C"],"Age":[23,33,21],"Result":["Pass","Fail","Pass"]},index=["a","b","c"])
df1

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [139]:
df1.drop("Result",axis=1)

  Name  Age
a    A   23
b    B   33
c    C   21

In [148]:
df1

  Name  Age Result
a    A   23   Pass
b    B   33   Fail
c    C   21   Pass

In [149]:
df1.drop("Age",axis=1,inplace=True)
df1

  Name Result
a    A   Pass
b    B   Fail
c    C   Pass

# Sorting data frames with column values

In [150]:
d={"Name":["Sam","Jane","Kane"],"Mark1":[67,54,44],"Mark2":[56,56,67],"Mark3":[78,89,76]}
df=pd.DataFrame(d)
df

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [151]:
df.sort_values(by="Mark1")

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
1  Jane     54     56     89
0   Sam     67     56     78

In [152]:
df.sort_values(by="Mark3")

   Name  Mark1  Mark2  Mark3
2  Kane     44     67     76
0   Sam     67     56     78
1  Jane     54     56     89

In [153]:
df.sort_values(by="Mark1",ascending=False)

   Name  Mark1  Mark2  Mark3
0   Sam     67     56     78
1  Jane     54     56     89
2  Kane     44     67     76

In [154]:
df.sort_values(by="Name")

   Name  Mark1  Mark2  Mark3
1  Jane     54     56     89
2  Kane     44     67     76
0   Sam     67     56     78

# Grouping data frames with categorical data

In [155]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [159]:
g=df.groupby("Gender")
list(g)

[('F',
       ID  Age Gender  Marks
  0  1001   23      F     67
  1  1002   33      F     69
  3  1004   24      F     74),
 ('M',
       ID  Age Gender  Marks
  2  1003   34      M     76
  4  1005   25      M     90)]

# Using generators

In [161]:
# to access the groups individualy

In [163]:
x=df.groupby("Gender").__iter__()

In [164]:
a=x.__next__()

In [165]:
b=x.__next__()

In [166]:
a

('F',
      ID  Age Gender  Marks
 0  1001   23      F     67
 1  1002   33      F     69
 3  1004   24      F     74)

In [167]:
b

('M',
      ID  Age Gender  Marks
 2  1003   34      M     76
 4  1005   25      M     90)

# Selecting a specific group

In [168]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [169]:
df.groupby("Gender").get_group("M")

     ID  Age Gender  Marks
2  1003   34      M     76
4  1005   25      M     90

In [170]:
df.groupby("Gender").get_group("F")

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
3  1004   24      F     74

# Summaries for other variables with grouping

In [171]:
d={"ID":[1001,1002,1003,1004,1005],"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90]}
df=pd.DataFrame(d)
df

     ID  Age Gender  Marks
0  1001   23      F     67
1  1002   33      F     69
2  1003   34      M     76
3  1004   24      F     74
4  1005   25      M     90

In [174]:
df.drop("ID",axis=1,inplace=True)

In [175]:
 df.groupby("Gender").mean()

              Age  Marks
Gender
F       26.666667   70.0
M       29.500000   83.0

In [176]:
 df.groupby("Gender").sum()

        Age  Marks
Gender
F        80    210
M        59    166

In [177]:
 df.groupby("Gender")["Age"].mean()

Gender
F    26.666667
M    29.500000
Name: Age, dtype: float64

In [178]:
 df.groupby("Gender")["Age"].sum()

Gender
F    80
M    59
Name: Age, dtype: int64

# Summarizing other variables with grouping by using multiple options

In [180]:
 df.groupby("Gender").agg(["mean","sum","median","max","min"])

              Age                    Marks
             mean sum median max min  mean  sum median max min
Gender
F       26.666667  80   24.0  33  23  70.0  210   69.0  74  67
M       29.500000  59   29.5  34  25  83.0  166   83.0  90  76

# Grouping with more than one columns

In [181]:
d={"Age":[23,33,34,24,25],"Gender":["F","F","M","F","M"],"Marks":[67,69,76,74,90],"University":["UOC","UOC","UOC","UOP","UOP"]}
df=pd.DataFrame(d)
df

   Age Gender  Marks University
0   23      F     67        UOC
1   33      F     69        UOC
2   34      M     76        UOC
3   24      F     74        UOP
4   25      M     90        UOP

In [183]:
df.groupby(["Gender","University"]).mean()

                    Age  Marks
Gender University
F      UOC         28.0   68.0
       UOP         24.0   74.0
M      UOC         34.0   76.0
       UOP         25.0   90.0

In [185]:
df.groupby(["Gender","University"]).agg(["mean","sum","median","max","min"])

                    Age                    Marks
                   mean sum median max min  mean  sum median max min
Gender University
F      UOC         28.0  56   28.0  33  23  68.0  136   68.0  69  67
       UOP         24.0  24   24.0  24  24  74.0   74   74.0  74  74
M      UOC         34.0  34   34.0  34  34  76.0   76   76.0  76  76
       UOP         25.0  25   25.0  25  25  90.0   90   90.0  90  90

# Concatenating data frames

In [186]:
df1=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df2=pd.DataFrame(np.random.random((5,2)),columns=["A","B"])
df3=pd.DataFrame(np.random.random((5,2)),columns=["C","D"])

In [187]:
df1

          A         B
0  0.543103  0.488664
1  0.282027  0.644403
2  0.267001  0.953377
3  0.447046  0.301660
4  0.704738  0.307654

In [188]:
df2

          A         B
0  0.443849  0.195475
1  0.239659  0.616822
2  0.745847  0.319701
3  0.993526  0.315174
4  0.858613  0.328516

In [189]:
df3

          C         D
0  0.924588  0.930808
1  0.328278  0.771890
2  0.393581  0.911766
3  0.616336  0.739558
4  0.778889  0.620168

# Concatenating along the rows

In [190]:
pd.concat([df1,df2],ignore_index=True)

          A         B
0  0.543103  0.488664
1  0.282027  0.644403
2  0.267001  0.953377
3  0.447046  0.301660
4  0.704738  0.307654
5  0.443849  0.195475
6  0.239659  0.616822
7  0.745847  0.319701
8  0.993526  0.315174
9  0.858613  0.328516

In [191]:
pd.concat([df1,df2])

          A         B
0  0.543103  0.488664
1  0.282027  0.644403
2  0.267001  0.953377
3  0.447046  0.301660
4  0.704738  0.307654
0  0.443849  0.195475
1  0.239659  0.616822
2  0.745847  0.319701
3  0.993526  0.315174
4  0.858613  0.328516

# Concatenating along the columns

In [203]:
pd.concat([df1,df2])

   ID  Val1  Val2
0   1  23.0   NaN
1   2  33.0   NaN
2   3  34.0   NaN
3   4  45.0   NaN
0   3   NaN  56.0
1   4   NaN  32.0
2   5   NaN  67.0
3   6   NaN  65.0

# Merging data frames

In [193]:
df1=pd.DataFrame({"ID":[1,2,3,4],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID":[3,4,5,6],"Val2":[56,32,67,65]})

In [194]:
df1

   ID  Val1
0   1    23
1   2    33
2   3    34
3   4    45

In [196]:
df2

   ID  Val2
0   3    56
1   4    32
2   5    67
3   6    65

In [204]:
pd.concat([df1,df2])

   ID  Val1  Val2
0   1  23.0   NaN
1   2  33.0   NaN
2   3  34.0   NaN
3   4  45.0   NaN
0   3   NaN  56.0
1   4   NaN  32.0
2   5   NaN  67.0
3   6   NaN  65.0

# Focus on the common Ids

In [216]:
 #in here it merge the same ID numbers , see ID number 3 and 4
# on ="common_column_name" how="inner" :- gives only the common IDs

In [213]:
pd.merge(df1,df2,on="ID",how="inner")

   ID  Val1  Val2
0   3    34    56
1   4    45    32

# Focus on the all Ids

In [215]:
pd.merge(df1,df2,on="ID",how="outer")
# how = "outer" :- gives all common and uncommon IDs

   ID  Val1  Val2
0   1  23.0   NaN
1   2  33.0   NaN
2   3  34.0  56.0
3   4  45.0  32.0
4   5   NaN  67.0
5   6   NaN  65.0

# Focus on the left side data frame Ids

In [218]:
pd.merge(df1,df2,on="ID",how="left")                 #give priority to df1

   ID  Val1  Val2
0   1    23   NaN
1   2    33   NaN
2   3    34  56.0
3   4    45  32.0

# Focus on the right side data frame Ids

In [220]:
pd.merge(df1,df2,on="ID",how="right")                 #give priority to df2

   ID  Val1  Val2
0   3  34.0    56
1   4  45.0    32
2   5   NaN    67
3   6   NaN    65

# Using an indicator for showing how the tables are merged

In [221]:
pd.merge(df1,df2,on="ID",how="outer",indicator=True)

   ID  Val1  Val2      _merge
0   1  23.0   NaN   left_only
1   2  33.0   NaN   left_only
2   3  34.0  56.0        both
3   4  45.0  32.0        both
4   5   NaN  67.0  right_only
5   6   NaN  65.0  right_only

# Merging based on more than one column

In [222]:
df1=pd.DataFrame({"ID1":[1,2,3,4],"ID2":[7,8,9,10],"Val1":[23,33,34,45]})
df2=pd.DataFrame({"ID1":[2,3,5,6],"ID2":[8,9,10,11],"Val2":[56,32,67,65]})

In [223]:
df1                    # primary key   ID1 and ID2

   ID1  ID2  Val1
0    1    7    23
1    2    8    33
2    3    9    34
3    4   10    45

In [224]:
df2                   # primary key   ID1 and ID2

   ID1  ID2  Val2
0    2    8    56
1    3    9    32
2    5   10    67
3    6   11    65

In [225]:
#combining these tables using these ID1 and ID2

In [226]:
pd.merge(df1,df2,on=["ID1","ID2"],how="inner")

   ID1  ID2  Val1  Val2
0    2    8    33    56
1    3    9    34    32

In [227]:
pd.merge(df1,df2,on=["ID1","ID2"],how="outer")

   ID1  ID2  Val1  Val2
0    1    7  23.0   NaN
1    2    8  33.0  56.0
2    3    9  34.0  32.0
3    4   10  45.0   NaN
4    5   10   NaN  67.0
5    6   11   NaN  65.0

# Counting values

In [228]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [229]:
pd.value_counts(df["Col1"])

P    2
Q    1
Name: Col1, dtype: int64

In [230]:
pd.value_counts(df["Col2"])

X    1
Y    1
Z    1
Name: Col2, dtype: int64

In [231]:
df["Col1"].value_counts()

P    2
Q    1
Name: Col1, dtype: int64

# Unique values in a column

In [232]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":["A","B","C"]}
df=pd.DataFrame(d)
df

  Col1 Col2 Col3
0    P    X    A
1    P    Y    B
2    Q    Z    C

In [233]:
df["Col1"].unique()

array(['P', 'Q'], dtype=object)

# Counting unique elements

In [235]:
df["Col1"].nunique()             #gives number of unique elements

2

# Replace values in data frame

In [239]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [237]:
#changing one element
df.iloc[0,0]="B"
df

  Col1 Col2  Col3
0    B    X     3
1    P    Y     6
2    Q    Z     8

In [243]:
#changing  all P s into A s in Col1
df["Col1"].replace("P","A",inplace=True)
df

  Col1 Col2  Col3
0    A    X     3
1    A    Y     6
2    Q    Z     8

In [247]:
#changing  X , Y s into K and L
df["Col2"].replace(["X","Y"],["K","L"],inplace=True)
df

  Col1 Col2  Col3
0    A    K     3
1    A    L     6
2    Q    Z     8

# Stacking & Unstacking data frames

In [248]:
d={"Col1":["P","P","Q"],"Col2":["X","Y","Z"],"Col3":[3,6,8]}
df=pd.DataFrame(d)
df

  Col1 Col2  Col3
0    P    X     3
1    P    Y     6
2    Q    Z     8

In [250]:
st=df.stack()
st

0  Col1    P
   Col2    X
   Col3    3
1  Col1    P
   Col2    Y
   Col3    6
2  Col1    Q
   Col2    Z
   Col3    8
dtype: object

In [251]:
st.unstack()

  Col1 Col2 Col3
0    P    X    3
1    P    Y    6
2    Q    Z    8

# Creating Pivot tables

In [260]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat  Val
0   A    4
1   B    5
2   B    6
3   A    8
4   C    3
5   A    9
6   C    8
7   B    2

In [262]:
df.pivot_table(index="Cat",aggfunc=["mean","sum","median","count"])

         mean sum median count
          Val Val    Val   Val
Cat
A    7.000000  21    8.0     3
B    4.333333  13    5.0     3
C    5.500000  11    5.5     2

In [264]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat Rank  Val
0   A    1    4
1   B    2    5
2   B    1    6
3   A    2    8
4   C    1    3
5   A    2    9
6   C    1    8
7   B    2    2

In [266]:
df.pivot_table(index=["Cat","Rank"],aggfunc=["mean","sum","median","max","min","count"])

         mean sum median max min count
          Val Val    Val Val Val   Val
Cat Rank
A   1     4.0   4    4.0   4   4     1
    2     8.5  17    8.5   9   8     2
B   1     6.0   6    6.0   6   6     1
    2     3.5   7    3.5   5   2     2
C   1     5.5  11    5.5   8   3     2

In [269]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val1":[4,5,6,8,3,9,8,2],
  "Val2":[6,4,7,9,3,5,9,2]}
df=pd.DataFrame(d)
df

  Cat Rank  Val1  Val2
0   A    1     4     6
1   B    2     5     4
2   B    1     6     7
3   A    2     8     9
4   C    1     3     3
5   A    2     9     5
6   C    1     8     9
7   B    2     2     2

In [270]:
df.pivot_table(index=["Cat","Rank"],aggfunc=["mean","sum","median","max","min","count"])

         mean       sum      median       max       min      count
         Val1 Val2 Val1 Val2   Val1 Val2 Val1 Val2 Val1 Val2  Val1 Val2
Cat Rank
A   1     4.0    6    4    6    4.0    6    4    6    4    6     1    1
    2     8.5    7   17   14    8.5    7    9    9    8    5     2    2
B   1     6.0    7    6    7    6.0    7    6    7    6    7     1    1
    2     3.5    3    7    6    3.5    3    5    4    2    2     2    2
C   1     5.5    6   11   12    5.5    6    8    9    3    3     2    2

# Binning

In [275]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [285]:
#MEthod 1
df["Col3"]=["A" if m>75 else "B" if m>55 else "C" if m>45 else "F"  for m in df["Marks"] ]
df

     ID  Marks Col3
0  1001     78    A
1  1002     88    A
2  1003     45    F
3  1004     67    B
4  1005     59    B

In [272]:
d={"ID":[1001,1002,1003,1004,1005],"Marks":[78,88,45,67,59]}
df=pd.DataFrame(d)
df

     ID  Marks
0  1001     78
1  1002     88
2  1003     45
3  1004     67
4  1005     59

In [289]:
#Method 2
df["Grades"]=pd.cut(df["Marks"],[0,50,65,80,100],labels=["F","C","B","A"])
df

     ID  Marks Col3 Grades
0  1001     78    A      B
1  1002     88    A      A
2  1003     45    F      F
3  1004     67    B      B
4  1005     59    B      C

In [293]:
df["Result"]=pd.cut(df["Marks"],[0,50,100],labels=["Fail","Pass"])
df

     ID  Marks Col3 Grades Result
0  1001     78    A      B   Pass
1  1002     88    A      A   Pass
2  1003     45    F      F   Fail
3  1004     67    B      B   Pass
4  1005     59    B      C   Pass

# Largest and smallest values in a column

In [303]:
d={"Cat":["A","B","B","A","C","A","C","B"],"Rank":["1","2","1","2","1","2","1","2"],"Val":[4,5,6,8,3,9,8,2]}
df=pd.DataFrame(d)
df

  Cat Rank  Val
0   A    1    4
1   B    2    5
2   B    1    6
3   A    2    8
4   C    1    3
5   A    2    9
6   C    1    8
7   B    2    2

In [304]:
df.nlargest(1,"Val")              # largest value of the Val column

  Cat Rank  Val
5   A    2    9

In [305]:
df.nlargest(2,"Val")              #2nd largest value of the Val column

  Cat Rank  Val
5   A    2    9
3   A    2    8

In [306]:
df.nlargest(3,"Val")              #3rd largest value of the Val column

  Cat Rank  Val
5   A    2    9
3   A    2    8
6   C    1    8

In [308]:
df.nsmallest(1,"Val")          # smallest value of the Val column

  Cat Rank  Val
7   B    2    2

# Working with indexes & columns

In [312]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

# Columns of the data frame

In [313]:
df.columns

Index(['Name', 'Marks', 'Class'], dtype='object')

In [314]:
list(df.columns)

['Name', 'Marks', 'Class']

# Indexes of the data frame

In [315]:
list(df.index)

['a', 'b', 'c']

# Changing the order of the rows

In [317]:
df1=df.reindex(["b","c","a"])            #changin the row order
df1

   Name  Marks  Class
b   Pam     32      2
c  Jane     78      3
a   Sam     56      1

# Changing the order of the columns

In [318]:
df.reindex(columns=["Name","Class","Marks"])              # changing the column order

   Name  Class  Marks
a   Sam      1     56
b   Pam      2     32
c  Jane      3     78

# Renaming the indexes & columns

In [321]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [323]:
df.rename(index={"a":"p","b":"q"})                  #indexes are changed

   Name  Marks  Class
p   Sam     56      1
q   Pam     32      2
c  Jane     78      3

In [325]:
df.rename(columns={"Name":"St_Name"})                  #columns are changed

  St_Name  Marks  Class
a     Sam     56      1
b     Pam     32      2
c    Jane     78      3

# Making indexes as a column

In [326]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [327]:
df.reset_index()

  index  Name  Marks  Class
0     a   Sam     56      1
1     b   Pam     32      2
2     c  Jane     78      3

# Making a column as the index set

In [328]:
d={"Name":["Sam","Pam","Jane"],"Marks":[56,32,78],"Class":[1,2,3]}
df=pd.DataFrame(d,index=["a","b","c"])
df

   Name  Marks  Class
a   Sam     56      1
b   Pam     32      2
c  Jane     78      3

In [330]:
df.set_index("Name")            #gives the name column as index

      Marks  Class
Name
Sam      56      1
Pam      32      2
Jane     78      3

# Permutation & taking samples

In [5]:
d={"A":np.arange(1,11),"B":np.random.random(10),"C":np.random.randn(10)}
df=pd.DataFrame(d)
df

    A         B         C
0   1  0.167861  1.560144
1   2  0.728015 -0.687430
2   3  0.871591  0.101922
3   4  0.354356  1.595438
4   5  0.459325 -0.471369
5   6  0.725795  0.984216
6   7  0.834108 -1.079502
7   8  0.876632 -0.136644
8   9  0.593197 -1.441963
9  10  0.406915  0.760437

# Method 01 - Taking a shuffled data frame

# Shuffling data

In [8]:
np.random.permutation(10)                   #gives random data set

array([3, 2, 9, 5, 4, 8, 7, 1, 0, 6])

In [10]:
df1=df.take(np.random.permutation(len(df)))             #shuffeled data set
df1

    A         B         C
6   7  0.834108 -1.079502
3   4  0.354356  1.595438
7   8  0.876632 -0.136644
1   2  0.728015 -0.687430
9  10  0.406915  0.760437
2   3  0.871591  0.101922
8   9  0.593197 -1.441963
4   5  0.459325 -0.471369
5   6  0.725795  0.984216
0   1  0.167861  1.560144

# Random sample

In [11]:
import random as rm

In [12]:
L=[23,45,67,1,23,56,78,90]

In [15]:
rm.sample(L,5)                     #gives random 5 elements from list L

[56, 23, 67, 1, 45]

In [24]:
np.arange(len(df))                     # gives indexes of df as array

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [25]:
list(np.arange(len(df)))            # convert above array to a list

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [18]:
rm.sample(list(np.arange(len(df))),5)                #give random 5 indexes of df data set

[9, 7, 8, 1, 0]

In [19]:
df2=df.take(rm.sample(list(np.arange(len(df))),5))      #give random 5 dataset of df data set
df2

   A         B         C
2  3  0.871591  0.101922
5  6  0.725795  0.984216
7  8  0.876632 -0.136644
8  9  0.593197 -1.441963
3  4  0.354356  1.595438

# Method 02 - Shuffling existing indexes

In [29]:
np.random.permutation(df.index)

array([0, 4, 7, 6, 1, 2, 9, 5, 8, 3], dtype=int64)

   A         B         C
3  4  0.354356  1.595438
4  5  0.459325 -0.471369
2  3  0.871591  0.101922

# Method 03 - Sample method

# Random sample

In [33]:
df.sample(3)

   A         B         C
1  2  0.728015 -0.687430
4  5  0.459325 -0.471369
0  1  0.167861  1.560144

# Shuffling data frame

In [34]:
df.sample(len(df))

    A         B         C
5   6  0.725795  0.984216
9  10  0.406915  0.760437
7   8  0.876632 -0.136644
4   5  0.459325 -0.471369
0   1  0.167861  1.560144
6   7  0.834108 -1.079502
1   2  0.728015 -0.687430
3   4  0.354356  1.595438
8   9  0.593197 -1.441963
2   3  0.871591  0.101922

# Working with dates

# Converting strings to dates

In [35]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [38]:
df["date"]=pd.to_datetime(df["date"])
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

In [46]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],'value': [2, 3, 4]})
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [51]:
df["date"]=pd.to_datetime(df["date"],dayfirst=True)
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

In [52]:
df = pd.DataFrame({'date': ['3-10-2000', '3-11-2000', '3-12-2000'],'value': [2, 3, 4]})
df

        date  value
0  3-10-2000      2
1  3-11-2000      3
2  3-12-2000      4

In [56]:
df["date"]=pd.to_datetime(df["date"],dayfirst=True)
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

In [64]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0','2016-7-1 19:45:30','2013-10-12 4:5:1'],'value': [2, 3, 4]})
df

                date  value
0  2016-6-10 20:30:0      2
1  2016-7-1 19:45:30      3
2   2013-10-12 4:5:1      4

In [61]:
df["date"]=pd.to_datetime(df["date"],format="%Y-%m-%d %H:%M:%S")
df

                 date  value
0 2016-06-10 20:30:00      2
1 2016-07-01 19:45:30      3
2 2013-10-12 04:05:01      4

# Assemble a datetime from multiple columns

In [70]:
df = pd.DataFrame({'year': [2015, 2016],'month': [2, 3],'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [71]:
df["date"]=pd.to_datetime(df)
df

   year  month  day       date
0  2015      2    4 2015-02-04
1  2016      3    5 2016-03-05

# Separate year, month, and day

In [90]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],'DOB': ['08-05-1997', '04-28-1996', '12-16-1995']})
df

    name         DOB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12-16-1995

In [93]:
df["DOB"]=pd.to_datetime(df["DOB"])
df

    name        DOB
0    Tom 1997-08-05
1   Andy 1996-04-28
2  Lucas 1995-12-16

In [94]:
df["DOB"].dt.year

0    1997
1    1996
2    1995
Name: DOB, dtype: int64

In [95]:
df["DOB"].dt.month

0     8
1     4
2    12
Name: DOB, dtype: int64

In [96]:
df["DOB"].dt.day

0     5
1    28
2    16
Name: DOB, dtype: int64

# Get more information

In [97]:
df["DOB"].dt.week

C:\Users\ASUS\AppData\Local\Temp\ipykernel_19468\2541462711.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df["DOB"].dt.week

0    32
1    17
2    50
Name: DOB, dtype: int64

In [98]:
df["DOB"].dt.dayofweek

0    1
1    6
2    5
Name: DOB, dtype: int64

In [101]:
df["DOB"].dt.is_leap_year                        #find the year iss a leap year or not

0    False
1     True
2    False
Name: DOB, dtype: bool